console.log("text1!");

var result = 'number' + 3 + 3; // Рузультат number33. Конкатенація. Вона склеїла інші значення. Коли є текст та цифри , конвертації немає
console.log(result);
var result2 = null + 3; // Результат 3. Null цe 0 , тому 0+3=3
console.log(result2);

var result3 = 5 && "qwerty"; //Результат qwerty. Повертає останнє значення, тому що обидва значення true
console.log(result3);

var result4 = +'40' + +'2' + "hillel"; //Результат 42hillel. Унарний плюс перетворив строки в числа, потім конкатенація, склеювання текста з цифрами.
console.log(result4);

var result5 = '10' - 5 === 6; // Результат False. через те що є мінус, js перетворив 10 в число , 10-5=5 , тому результат false
console.log(result5); 

var result6 = true + false; // Результат 1. true перетворилось на 0, false перетворилось на 1. 0+1 = 1
console.log(result6);

var result7 = '4px' - 3; // Результат NaN, js не може перетворити '4px' в число тому що є ще текст
console.log(result7);

var result8 = '4' - 3; // Результат 1. js перетворив '4' в число тому що є мінус. 4-3=1
console.log(result8);

var result9 = '6' + 3 ** 0; //Результат 61. Спочатку возвелось в ступінь 3 ** 0 , якщо число возводиться в ступінь 0, результат буде 1. Далі йде склейка '6' + 1 = 61
console.log(result9);

var result10 = 12 / '6'; // Результат 2, js перетворив '6' на число тому щр є ділення. 12/6=2
console.log(result10);

var result11 = '10' + (5 === 6); // Результат 10false. Спочатку js перевіряє строге рівняння 5===6, буде false. Далі йде склеювання 10False
console.log(result11);

var result12 = null == ''; // Результат false. Нестроге порівняння null і пуста строка мають різні типи данних, тому результат false.
console.log(result12);

var result13 = 3 ** (9 / 3); // Результат 27, спочатку js розраховує ділення 9/3= 3; потім приводить до ступеню 3**3 =27
console.log(result13);

var result14 = !!'false' == !!'true'; // Результат true, подвійні (ні !!) привели строки к булевому значенню, в js будь-яка строка це true, тому 'false' стає true , і 'true' залишється true.
console.log(result14);

var result15 = 0 || '0' && 1; // Результат 1. Згідно з пріоритезації , спочатку js виконує '0' && 1 (не пусті строки це true, 1 це теж true) , якщо обидва true, то повертає останнє, тому '0' && 1= 1; Далі йде 0 || 1 (1 як результат '0' && 1 ). || повертає перший істинний варіант. 0 це false , тому повернеться 1 
console.log(result15);

var result16 = (+null == false) < 1; // Результат false. +null перетворило на число 0, потім 0 порівнюється з false (false це теж 0), 0 == 0 буде true. true розцінюється як 1. 1<1 буде false
console.log(result16);

var result17 = false && true || true; // Результат true. Спочатку виконується операція false && true , результатом буде false ( так як тут хоча б один операнд ложний), далі виконується false(як результат минулої) || true , так як хоча б один операнд правдивий, то результат буде true
console.log(result17);

var result18 = false && (false || true); // Результат false. Спочатку виконується в дужках false || true, буде true (так як хоча б один операнд правдивий), далі false && true (true як результат ) і результатом буде false (так як хоча б один операнд ложний)
console.log(result18);

var result19 = (+null == false) < 1 ** 5; // Результат false. Спочатку виконується в дужках +null == false , +null преобразується в 0 , 0 == false , результат буде true (тому що false це 0); Далі виконується приведення до ступіню 1 ** 5 , буде 1; Далі true <1, true перетворюється в 1, 1<1 = false
console.log(result19);
